experiments/d3000-pkvm-apps/results/d3000-apps-never-20260714-100618/pair-1/protected/redis-r4-bgsave/rep-03/memtier.txt
4         Threads
25        Connections per thread
360       Seconds


ALL STATS
============================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p95 Latency     p99 Latency   p99.9 Latency       KB/sec 
--------------------------------------------------------------------------------------------------------------------------------------------
Sets        46965.68          ---          ---         0.74029         0.75900         0.91100         1.51900         1.73500     48884.72 
Gets        46965.53     46965.53         0.00         0.74124         0.75900         0.90300         1.51900         1.72700     48655.24 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---          --- 
Totals      93931.20     46965.53         0.00         0.74077         0.75900         0.90300         1.51900         1.73500     97539.97 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.023        0.000
SET       0.335        5.000
SET       0.583       10.000
SET       0.695       15.000
SET       0.711       20.000
SET       0.727       25.000
SET       0.735       30.000
SET       0.743       35.000
SET       0.751       40.000
SET       0.759       45.000
SET       0.759       50.000
SET       0.767       52.500
SET       0.767       55.000
SET       0.767       57.500
SET       0.767       60.000
SET       0.775       62.500
SET       0.775       65.000
SET       0.775       67.500
SET       0.783       70.000
SET       0.783       72.500
SET       0.783       75.000
SET       0.783       76.250
SET       0.791       77.500
SET       0.791       78.750
SET       0.791       80.000
SET       0.791       81.250
SET       0.799       82.500
SET       0.799       83.750
SET       0.807       85.000
SET       0.815       86.250
SET       0.831       87.500
SET       0.831       88.125
SET       0.839       88.750
SET       0.847       89.375
SET       0.855       90.000
SET       0.863       90.625
SET       0.863       91.250
SET       0.871       91.875
SET       0.879       92.500
SET       0.887       93.125
SET       0.895       93.750
SET       0.895       94.062
SET       0.903       94.375
SET       0.903       94.688
SET       0.911       95.000
SET       0.919       95.312
SET       0.927       95.625
SET       0.943       95.938
SET       0.967       96.250
SET       0.983       96.562
SET       1.015       96.875
SET       1.023       97.031
SET       1.039       97.188
SET       1.063       97.344
SET       1.095       97.500
SET       1.167       97.656
SET       1.263       97.812
SET       1.367       97.969
SET       1.407       98.125
SET       1.439       98.281
SET       1.455       98.438
SET       1.471       98.516
SET       1.479       98.594
SET       1.487       98.672
SET       1.495       98.750
SET       1.503       98.828
SET       1.511       98.906
SET       1.519       98.984
SET       1.527       99.062
SET       1.527       99.141
SET       1.535       99.219
SET       1.543       99.258
SET       1.543       99.297
SET       1.543       99.336
SET       1.551       99.375
SET       1.551       99.414
SET       1.559       99.453
SET       1.559       99.492
SET       1.567       99.531
SET       1.567       99.570
SET       1.575       99.609
SET       1.575       99.629
SET       1.583       99.648
SET       1.583       99.668
SET       1.591       99.688
SET       1.591       99.707
SET       1.599       99.727
SET       1.607       99.746
SET       1.615       99.766
SET       1.631       99.785
SET       1.647       99.805
SET       1.655       99.814
SET       1.663       99.824
SET       1.671       99.834
SET       1.679       99.844
SET       1.695       99.854
SET       1.703       99.863
SET       1.711       99.873
SET       1.719       99.883
SET       1.727       99.893
SET       1.735       99.902
SET       1.743       99.907
SET       1.743       99.912
SET       1.751       99.917
SET       1.751       99.922
SET       1.759       99.927
SET       1.759       99.932
SET       1.767       99.937
SET       1.775       99.941
SET       1.775       99.946
SET       1.783       99.951
SET       1.783       99.954
SET       1.791       99.956
SET       1.791       99.958
SET       1.799       99.961
SET       1.799       99.963
SET       1.807       99.966
SET       1.807       99.968
SET       1.815       99.971
SET       1.823       99.973
SET       1.831       99.976
SET       1.831       99.977
SET       1.839       99.978
SET       1.839       99.979
SET       1.847       99.980
SET       1.855       99.982
SET       1.855       99.983
SET       1.863       99.984
SET       1.871       99.985
SET       1.879       99.987
SET       1.887       99.988
SET       1.895       99.988
SET       1.903       99.989
SET       1.903       99.990
SET       1.911       99.990
SET       1.919       99.991
SET       1.927       99.991
SET       1.935       99.992
SET       1.951       99.993
SET       1.959       99.993
SET       1.967       99.994
SET       1.975       99.994
SET       1.983       99.995
SET       1.991       99.995
SET       1.999       99.995
SET       2.007       99.995
SET       2.015       99.996
SET       2.023       99.996
SET       2.031       99.996
SET       2.063       99.997
SET       2.079       99.997
SET       2.095       99.997
SET       2.127       99.997
SET       2.175       99.997
SET       2.223       99.998
SET       2.271       99.998
SET       2.319       99.998
SET       2.367       99.998
SET       2.415       99.998
SET       2.495       99.998
SET       2.591       99.998
SET       2.623       99.999
SET       2.655       99.999
SET       2.719       99.999
SET       2.767       99.999
SET       2.831       99.999
SET       2.895       99.999
SET       2.959       99.999
SET       3.007       99.999
SET       3.007       99.999
SET       3.023       99.999
SET       3.023       99.999
SET       3.055       99.999
SET       3.135       99.999
SET       3.519       99.999
SET       3.887       99.999
SET      79.359       99.999
SET      79.871      100.000
SET      79.871      100.000
SET      80.383      100.000
SET      80.383      100.000
SET      80.383      100.000
[...]
SET     162.815      100.000
SET     168.959      100.000
SET     169.983      100.000
SET     169.983      100.000
SET     169.983      100.000
[...]
SET     171.007      100.000
SET     171.007      100.000
---
GET       0.023        0.000
GET       0.383        5.000
GET       0.599       10.000
GET       0.703       15.000
GET       0.719       20.000
GET       0.727       25.000
GET       0.735       30.000
GET       0.743       35.000
GET       0.751       40.000
GET       0.751       45.000
GET       0.759       50.000
GET       0.759       52.500
GET       0.767       55.000
GET       0.767       57.500
GET       0.767       60.000
GET       0.767       62.500
GET       0.775       65.000
GET       0.775       67.500
GET       0.775       70.000
GET       0.783       72.500
GET       0.783       75.000
GET       0.783       76.250
GET       0.783       77.500
GET       0.791       78.750
GET       0.791       80.000
GET       0.791       81.250
GET       0.791       82.500
GET       0.799       83.750
GET       0.799       85.000
GET       0.807       86.250
GET       0.823       87.500
GET       0.823       88.125
GET       0.831       88.750
GET       0.839       89.375
GET       0.847       90.000
GET       0.855       90.625
GET       0.863       91.250
GET       0.863       91.875
GET       0.871       92.500
GET       0.879       93.125
GET       0.887       93.750
GET       0.887       94.062
GET       0.895       94.375
GET       0.895       94.688
GET       0.903       95.000
GET       0.911       95.312
GET       0.919       95.625
GET       0.927       95.938
GET       0.943       96.250
GET       0.959       96.562
GET       0.991       96.875
GET       1.007       97.031
GET       1.023       97.188
GET       1.039       97.344
GET       1.063       97.500
GET       1.111       97.656
GET       1.215       97.812
GET       1.343       97.969
GET       1.399       98.125
GET       1.431       98.281
GET       1.455       98.438
GET       1.471       98.516
GET       1.479       98.594
GET       1.487       98.672
GET       1.495       98.750
GET       1.503       98.828
GET       1.511       98.906
GET       1.519       98.984
GET       1.527       99.062
GET       1.527       99.141
GET       1.535       99.219
GET       1.543       99.258
GET       1.543       99.297
GET       1.543       99.336
GET       1.551       99.375
GET       1.551       99.414
GET       1.559       99.453
GET       1.559       99.492
GET       1.559       99.531
GET       1.567       99.570
GET       1.575       99.609
GET       1.575       99.629
GET       1.575       99.648
GET       1.583       99.668
GET       1.583       99.688
GET       1.591       99.707
GET       1.599       99.727
GET       1.599       99.746
GET       1.615       99.766
GET       1.623       99.785
GET       1.639       99.805
GET       1.647       99.814
GET       1.655       99.824
GET       1.671       99.834
GET       1.679       99.844
GET       1.687       99.854
GET       1.695       99.863
GET       1.703       99.873
GET       1.711       99.883
GET       1.719       99.893
GET       1.727       99.902
GET       1.735       99.907
GET       1.743       99.912
GET       1.743       99.917
GET       1.751       99.922
GET       1.751       99.927
GET       1.759       99.932
GET       1.759       99.937
GET       1.767       99.941
GET       1.775       99.946
GET       1.783       99.951
GET       1.783       99.954
GET       1.783       99.956
GET       1.791       99.958
GET       1.791       99.961
GET       1.799       99.963
GET       1.799       99.966
GET       1.807       99.968
GET       1.815       99.971
GET       1.815       99.973
GET       1.823       99.976
GET       1.831       99.977
GET       1.831       99.978
GET       1.839       99.979
GET       1.847       99.980
GET       1.847       99.982
GET       1.855       99.983
GET       1.863       99.984
GET       1.871       99.985
GET       1.879       99.987
GET       1.887       99.988
GET       1.887       99.988
GET       1.895       99.989
GET       1.903       99.990
GET       1.911       99.990
GET       1.919       99.991
GET       1.927       99.991
GET       1.935       99.992
GET       1.943       99.993
GET       1.951       99.993
GET       1.967       99.994
GET       1.967       99.994
GET       1.975       99.995
GET       1.983       99.995
GET       1.991       99.995
GET       2.007       99.995
GET       2.015       99.996
GET       2.031       99.996
GET       2.039       99.996
GET       2.063       99.997
GET       2.095       99.997
GET       2.143       99.997
GET       2.175       99.997
GET       2.207       99.997
GET       2.239       99.998
GET       2.287       99.998
GET       2.335       99.998
GET       2.367       99.998
GET       2.415       99.998
GET       2.479       99.998
GET       2.575       99.998
GET       2.623       99.999
GET       2.687       99.999
GET       2.751       99.999
GET       2.831       99.999
GET       2.911       99.999
GET       3.007       99.999
GET       3.007       99.999
GET       3.023       99.999
GET       3.023       99.999
GET       3.023       99.999
GET       3.119       99.999
GET       3.215       99.999
GET       3.343       99.999
GET      79.359       99.999
GET      79.359       99.999
GET      79.871       99.999
GET      79.871      100.000
GET      79.871      100.000
GET      79.871      100.000
[...]
GET      80.383      100.000
GET      80.383      100.000
GET      81.407      100.000
GET     162.815      100.000
GET     169.983      100.000
GET     169.983      100.000
GET     169.983      100.000
[...]
GET     171.007      100.000
GET     171.007      100.000
---
WAIT      0.000      100.000